#+TITLE: Weak lines from Manuel and Adal spectra
#+AUTHOR: William Henney
#+EMAIL: whenney@gmail.com
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:{} arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not "LOGBOOK") date:t
#+OPTIONS: e:t email:nil f:t inline:t num:nil p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t toc:nil todo:t |:t
#+EXCLUDE_TAGS: noexport
#+KEYWORDS: orion 
#+LANGUAGE: en
#+SELECT_TAGS: export

* Revisiting ORL diagnostics with Adal
   DEADLINE: <2014-06-27 Fri>
   :LOGBOOK:
   CLOCK: [2014-06-23 Mon 08:30]--[2014-06-23 Mon 08:38] =>  0:08
   CLOCK: [2014-06-22 Sun 21:46]--[2014-06-22 Sun 22:49] =>  1:03
   CLOCK: [2014-06-22 Sun 17:12]--[2014-06-22 Sun 18:12] =>  1:00
   CLOCK: [2014-06-22 Sun 13:25]--[2014-06-22 Sun 13:44] =>  0:19
   CLOCK: [2014-06-21 Sat 23:10]--[2014-06-22 Sun 01:43] =>  2:33
   CLOCK: [2014-06-21 Sat 14:49]--[2014-06-21 Sat 23:09] =>  8:20
   :END:
**** Plots of the Manu maps
:PROPERTIES:
:dir:      Manu-Nil
:noweb:    yes
:END:

#+name: aesthetics
#+BEGIN_SRC python
import seaborn as sns
bgcolor = "#808080" # mid gray
cmap = plt.cm.get_cmap('hot')
alpha_disk = 0.8
#+END_SRC


#+name: manu-find-mask
#+BEGIN_SRC python
  import numpy as np
  def find_mask(tab):
      if mask == 'nonzero':
          m = tab['d'+column] > 0.0
      elif mask == 'none':
          m = np.ones_like(tab).astype(bool)
      else:
          max_d = float(mask)
          m = (tab['d'+column] > 0.0) & (tab['d'+column] <= max_d)
      return m
#+END_SRC

#+name: manu-make-map
#+header: :var column="Flux" wav="4959" band="green" vmin="0.0" vmax="auto" ion="" mask="nonzero"
#+BEGIN_SRC python :return pltfile :results file 
  from astropy.table import Table
  import matplotlib.pyplot as plt
  <<aesthetics>>
  <<manu-find-mask>>
  fig = plt.figure(figsize=(10, 10))
  ax_map = plt.subplot(111, axisbg=bgcolor)
  table = Table.read("Tables/{}-{}.tab".format(wav, band), format='ascii.tab')
  if vmax == "auto":
      vmax = 4*table[column].mean()
  
  m = find_mask(table)
  mtab = table[m]
  scat = ax_map.scatter(mtab['x'], mtab['y'], s=45, c=mtab[column], vmin=float(vmin), vmax=float(vmax), alpha=alpha_disk, edgecolors='none', cmap=cmap)
  cb = fig.colorbar(scat, ax=ax_map)
  ax_map.set_xlim(120.0, -120.0)
  ax_map.set_ylim(-160.0, 160.0)
  ax_map.set_aspect('equal', adjustable='box-forced')
  ax_map.set_xlabel('RA offset from th1, arcsec', fontsize='small')
  ax_map.set_ylabel('DEC offset from th1C, arcsec', fontsize='small')
  label = " ".join([ion, wav]) if ion else wav
  ax_map.set_title('{} {} {}'.format(column, label, band))
  pltfile = "Maps/{}-{}-{}.pdf".format(column, wav, band)
  fig.savefig(pltfile, dpi=300)
#+END_SRC



#+name: manu-ratio-map
#+header: :var wavA="4363" wavB="4649", band="blue" vmin="0.0" vmax="auto" mask="nonzero"
#+BEGIN_SRC python :return pltfile :results file 
  from astropy.table import Table
  import matplotlib.pyplot as plt
  import numpy as np
  <<aesthetics>>
  <<manu-find-mask>>
  column = 'Flux'
  fig = plt.figure(figsize=(10, 10))
  ax_map = plt.subplot(111, axisbg=bgcolor)
  tableA = Table.read("Tables/{}-{}.tab".format(wavA, band), format='ascii.tab')
  m = find_mask(tableA)
  colA = tableA[column]
  colB = np.zeros_like(colA)
  # allow sum of multiple lines in denominator
  if '+' in wavB:
      wavBlist = wavB.split('+')
  else:
      wavBlist = [wavB,]
  for wav in wavBlist:
      tableB = Table.read("Tables/{}-{}.tab".format(wav, band), format='ascii.tab')
      m = m & find_mask(tableB)
      colB += tableB[column]
  ratio = colA[m]/colB[m]
  meanratio = colA[m].mean()/colB[m].mean()
  if vmax == "auto":
      vmax = 4*meanratio
  scat = ax_map.scatter(tableA[m]['x'], tableA[m]['y'], s=45, c=ratio, vmin=float(vmin), vmax=float(vmax), alpha=alpha_disk, edgecolors='none', cmap=cmap)
  print(ratio.min(), ratio.max(), ratio.mean(), np.median(ratio), meanratio)
  cb = fig.colorbar(scat, ax=ax_map)
  ax_map.set_xlim(120.0, -120.0)
  ax_map.set_ylim(-160.0, 160.0)
  ax_map.set_aspect('equal', adjustable='box-forced')
  ax_map.set_xlabel('RA offset from th1, arcsec', fontsize='small')
  ax_map.set_ylabel('DEC offset from th1C, arcsec', fontsize='small')
  ax_map.set_title('Ratio {} / {} ({})'.format(wavA, wavB, band))
  pltfile = "Maps/Ratio-{}-{}-{}.pdf".format(wavA, wavB, band)
  fig.savefig(pltfile, dpi=300)
#+END_SRC

#+RESULTS: manu-ratio-map
: 5.23194386008e-12 2.33738127253e+15 322390979346.0 10.5513768152 9.49827430764

#+name: manu-diff-map
#+header: :var column="V" wavA="4363" wavB="4649", band="blue" vmin="auto" vmax="auto"
#+BEGIN_SRC python :return pltfile :results file 
  from astropy.table import Table
  import matplotlib.pyplot as plt
  import numpy as np
  <<aesthetics>>
  fig = plt.figure(figsize=(10, 10))
  ax_map = plt.subplot(111, axisbg=bgcolor)
  tableA = Table.read("Tables/{}-{}.tab".format(wavA, band), format='ascii.tab')
  tableB = Table.read("Tables/{}-{}.tab".format(wavB, band), format='ascii.tab')
  diff = tableA[column] - tableB[column]
  if vmax == "auto":
      vmax = diff.mean() + 4*diff.std()
  if vmin == "auto":
      vmin = diff.mean() - 4*diff.std()
  scat = ax_map.scatter(tableA['x'], tableA['y'], s=30, c=diff, vmin=float(vmin), vmax=float(vmax), alpha=alpha_disk, edgecolors='none', cmap=cmap)
  print(diff.min(), diff.max(), diff.mean(), np.median(diff), diff.std())
  cb = fig.colorbar(scat, ax=ax_map)
  ax_map.set_xlim(120.0, -120.0)
  ax_map.set_ylim(-160.0, 160.0)
  ax_map.set_aspect('equal', adjustable='box-forced')
  ax_map.set_xlabel('RA offset from th1, arcsec', fontsize='small')
  ax_map.set_ylabel('DEC offset from th1C, arcsec', fontsize='small')
  m = np.isfinite(diff)
  ax_map.set_title('{} difference: {} - {} ({}) mean, median, std = {:.1f}, {:.1f}, {:.1f}'.format(column, wavA, wavB, band, diff[m].mean(), np.median(diff[m]), diff[m].std()))
  pltfile = "Maps/Diff-{}-{}-{}-{}.pdf".format(column, wavA, wavB, band)
  fig.savefig(pltfile, dpi=300)
#+END_SRC

#+RESULTS: manu-diff-map
[[file:/Users/will/Work/RubinWFC3/Tsquared/Manu-Nil/Maps/Diff-V-4363-4649-blue.pdf]]


#+name: manu-qdiff-map
#+header: :var column="W" wavA="4363" wavB="4649", band="blue" vmin="auto" vmax="auto"
#+BEGIN_SRC python :return pltfile :results file 
  from astropy.table import Table
  import matplotlib.pyplot as plt
  import numpy as np
  <<aesthetics>>
  fig = plt.figure(figsize=(10, 10))
  ax_map = plt.subplot(111, axisbg=bgcolor)
  tableA = Table.read("Tables/{}-{}.tab".format(wavA, band), format='ascii.tab')
  tableB = Table.read("Tables/{}-{}.tab".format(wavB, band), format='ascii.tab')
  diff = np.sqrt(tableA[column]**2 - tableB[column]**2)
  if vmax == "auto":
      vmax = diff.mean() + 4*diff.std()
  if vmin == "auto":
      vmin = diff.mean() - 4*diff.std()
  scat = ax_map.scatter(tableA['x'], tableA['y'], s=30, c=diff, vmin=float(vmin), vmax=float(vmax), alpha=alpha_disk, edgecolors='none', cmap=cmap)
  print(diff.min(), diff.max(), diff.mean(), np.median(diff), diff.std())
  cb = fig.colorbar(scat, ax=ax_map)
  ax_map.set_xlim(120.0, -120.0)
  ax_map.set_ylim(-160.0, 160.0)
  ax_map.set_aspect('equal', adjustable='box-forced')
  ax_map.set_xlabel('RA offset from th1, arcsec', fontsize='small')
  ax_map.set_ylabel('DEC offset from th1C, arcsec', fontsize='small')
  m = np.isfinite(diff)
  ax_map.set_title('{} difference: {} - {} ({})  mean, median, std = {:.1f}, {:.1f}, {:.1f}'.format(column, wavA, wavB, band, diff[m].mean(), np.median(diff[m]), diff[m].std()))
  pltfile = "Maps/Qdiff-{}-{}-{}-{}.pdf".format(column, wavA, wavB, band)
  fig.savefig(pltfile, dpi=300)
#+END_SRC


* Original notes on ORL diagnostics
From the Manu spectra we can measure various useful ratios:
+ O II 4649/(4639+51+62) is density sensitive
  + We have it in the blue and green spectra but the green spectra are
    not so good
  + We have fitted the lines by assuming common velocity and width of all lines in the multiplet, and also that the 4639, 4651, 4662 components have a equal intensities.
    + This is somewhat justified by the very similar density dependences of those 3 lines, so long as the density is not too low (see Fig 6 of Fang & Liu 2013MNRAS.429.2791F).
+ O II Sum(V1)/[O III] 4959 is temperature sensitive
  + There are actually 8 lines in the V1 multiplet in total.  The four that we use for the density plus:
    + 4642, which we measure and is quite strong - theoretically it is about 22% of the total multiplet intensity with almost no density dependence above 1e3 pcc
      + However, it is blended with an N III line, which we would need to control for
    + 4676, which we measure but is weaker - 8% of the multiplet theoretically, again with almost no density dependence
    + 4674 and 4696 are very weak and we do not attempt to fit them.  But they add up to less than 2% of the total multiplet.
  + So there would be two possible approaches:
    1. Just use 4649+39+51+62 and then correct for the missing 4 components by dividing by (1 - 0.22 - 0.08 - 0.02) = 0.68 to get the total V1 intensity.
    2. Also add 4642 and 4676 and divide by (1 - 0.02) = 0.98 to get the total
       + But in this case we need to check for contamination of the 4642 line.  We could look at the histogram of 4642/(4639+51+62), which ought to be constant at about 0.22/0.68 = 0.32
       + Also with 4676 line we should maybe add in 4674 since it is probably blended.  So the expected ratio of (4674+4676)/(4639+51+62) is (0.08 + 0.02)/0.68 = 0.15
+ O II 4649/4591 is temperature sensitive
  + 4591 comes from a different multiplet - V15 supposedly
    + Fang calls them
      + M1 2p23p 4Do – 2p23s 4P λ4652
      + M48a 4f G[5,4,3]o – 3d 4 F λ4089
      + M15 3p′ 2Fo – 3s′ 2D has 4591
        + Supposedly the upper level is 6.76 eV below the ionization threshold
  + There is a graph in Fang 2013a Fig 21 upper.
    + Note that it is a *log scale* of 4649/4591
    + Typical value from our observations is log10(ratio) = 0.8 \pm 0.2, which implies log T = 3.65 \pm 0.25, which is (3000, 4500, 8000) K
    + To get > 8000 K require log10(ratio) < 0.6, which means 4591 > 1/4 4649
      + Very few of our positions have such strong 4591 lines
      + Looking at the fits to 4591, it seems that many have failed
      + Just taking ones that look like good fits, we get 4649/4591 ratios of 4.6, 10.3, 8.9, 9.9, 11.6 -> log(R) = 0.96 +/- 0.06, which means an even lower T
      + However, in some of the better quality spectra (e.g., blue-0226-0196) there is slight evidence for an underlying absorption line.  This indicates that 4649 may be under-estimated
      + This can be best investigating by looking at the spectra with low EW(H gamma)
        + For instance, blue-0382-0641 shows faint absorption on the blue side of all the He I lines.  Even here, it is hard to say there is any absorption at 4649 but probably there is. 
  + In summary we are probably on a hiding to nothing with this line.  Maybe we could order all the regions by 4363 ratio, split them into 4 parts and look at the average spectrum of each quartile to see if there is any variation in 4649/4591
    + Actually, it doesn't look so bad.  There is also the 4189 line from the V36 multiplet.  This and its companion 4185 lne are clearly detected.  There are no other lines to blend with them, although 4189 is actually two lines: 4189.79 + 4189.59.  The He II 4200 absorption line is nearby but does ot interfere with it.
    + 4649/4189 and 4649/4591 have almost identical dependences on T, falling with rising T.  They need to be about as low as 4 for "normal" temperatures of 8000 K.  The observed values of around 10 imply much lower T (4000 K or so)
    + 4649/4089 on the other hand should increase with increasing T.  The nominal observed value in Orion is 6.2, which actually implies temperatures > 1e4 K.  For 8000 K we expect a ratio of 3.7 (Fang & Liu 2013 Fig 17)
    + However, as Peimbert & Peimbert (2013) point out, this ignores the Si IV line at 4088.86, which has two effects:
      + Emission, being about 50% of the strength of the O II 4089.29 line
      + Underlying absorption: Simón-Díaz et al (2006) show the Si IV absorption in the wing of the H\delta line, with the following absorption depths:
        + th1C (O7V): 0.1
        + th1A and th1D (B0.5V): 0.2
        + th2A (O9V): 0.1
      + The He II 4200, 4541 lines that are seen in absorption show depths in the Orion spectra of about 3-4%, which is 4-5 times less that that seen in th1C.
      + If there were similar dilution of the Si IV feature, then this would be about a 2% absorption with a width of about 2 Angstrom.  EW ~= 0.04 \AA
      + But there may be less dilution since the later-type OB stars will contribute more than in the case of the He II lines.  Say that the continuum is 50% atomic, 25% th1C and 25% th1A/D, then the absorption will be 7%, with an EW of 0.15 \AA
      + But in that case, the high-resolution Esteban spectra should show a broad absorption trough with a narrower emission line
        + Even Adal's spectra should show that, and they don't
      + The 4089.29 emission line should have an EW of about -0.1 \AA
      + For comparison, the 4649 line has an EW of about -0.5 \AA
  + Try to find quantitative data on the lines from Storey (1994).  These are effective recombination coefficients in units of (1e-14 cm^{3} s^{-1}) for the whole multiplet as a function of T, and for n = 1e4
    | Mult | Transition             | wav (nm) |   n | Case | 5000 | 7500 | 10,000 | 12,500 | 15,000 | 20,000 |
    |------+------------------------+----------+-----+------+------+------+--------+--------+--------+--------|
    |    1 | 3p (.^{4}D^{o}) -- 3s (.^{4}P^{e}) |    465.2 | 1e4 | A    | 60.3 | 43.8 |   34.9 |   29.5 |   25.9 |   21.9 |
    |      |                        |          | 1e4 | B    | 62.4 | 45.4 |   36.2 |   30.6 |   26.9 |   22.8 |
    |      |                        |          | 1e2 | A    | 59.8 | 43.5 |   34.7 |   29.3 |   25.8 |   21.9 |
    |      |                        |          | 1e2 | B    | 61.8 | 45.1 |   36.0 |   30.5 |   26.8 |   22.7 |
    |      |                        |          | 1e6 | A    | 61.4 | 44.2 |   35.0 |   29.5 |   25.9 |   21.9 |
    |      |                        |          | 1e6 | B    | 63.6 | 45.8 |   36.3 |   30.6 |   26.9 |   22.7 |
  + So there is a difference of 5% between Case A/B but almost no dependence on density.
  + This is the data from NIST on the 4591 and 4649 line.  
    | Obs Wav (Å) | Ritz Wav (Å) | Aki (s-1) | Ei  (cm-1)  | Ek  (cm-1)  | Lower Level         | Upper Level          |
    |-------------+--------------+-----------+-------------+-------------+---------------------+----------------------|
    | 4 590.972   | 4 590.974    |  8.85e+07 | 206 971.68  | 228 747.45  | 2s22p2(1D)3s 2D 5/2 | 2s22p2(1D)3p 2F° 7/2 |
    | 4 649.1348  | 4 649.1347   |  7.84e+07 | 185 499.124 | 207 002.482 | 2s22p2(3P)3s 4P 5/2 | 2s22p2(3P)3p 4D° 7/2 |
  + So the core electrons are in a different ang mom state for the 4591 line.
    + This seems to be referred to as the *parentage*: most lines are .^{3}P but 4591 is .^{1}D
    + According to Sec 4.2 of Storey (1994), it is low-temperature dielectronic recombination that populates the .^{1}D and .^{1}S parentages.  He says it is very small, and doesn't show results for any lines, claiming that they all have \alpha_{eff} < 1e-14 cm^{3} s^{-1}
    + Note that the 4650 multiplet has a total recombination coefficient of about 4.4e-13 @ 7500 K, of which the 4649 line represents about 35% at a density of 1e4 pcc
  + Measurements from Figure of Fang & Liu for ratio, combined with data from Storey (1994) for V1:
    |     T | log10(4649 / 4591) | V1 4649 / V15 4591 |   Fit | Sum(V1) | 4649 @ 1e4 | 4591 @ 1e4 | V1 Dielec |
    |-------+--------------------+--------------------+-------+---------+------------+------------+-----------|
    |  1000 |               1.74 |              54.95 | 58.45 |         |         0. |      0.000 |   5.5e-12 |
    |  5000 |               0.75 |               5.62 |  5.46 |    60.3 |     21.105 |      3.755 |      0.01 |
    |  7500 |               0.62 |               4.17 |  4.06 |    43.8 |      15.33 |      3.676 |      0.04 |
    | 10000 |               0.55 |               3.55 |  3.55 |    34.9 |     12.215 |      3.441 |      0.19 |
    | 12500 |               0.51 |               3.24 |  3.31 |    29.5 |     10.325 |      3.187 |      0.61 |
    | 15000 |                0.5 |               3.16 |  3.17 |    25.9 |      9.065 |      2.869 |      1.38 |
    | 20000 |                    |                  1 |  3.04 |    21.9 |      7.665 |      7.665 |      4.04 |
    #+TBLFM: $3=10**$-1;f2::$4=2.85 + 0.7 ($1/1e4)**-1.9 ; f2::$6=0.35 $-1::$7=$6/$3;f3::$8=100 (0.1037 (1e4/$1) - 0.2657 + 0.2045 ($1/1e4) - 0.0028 ($1/1e4)**2) exp(-3.03 1e4 / $1) ; f2
  + So it looks like the 4591 line intensity is relatively insensitive to T
  + Dielectronic recombination rates:
    + Nusbaumer et al use an equation of the form:
    + 1e-12 [(a/t) + b + c t + d t^{2}] \times t^{-3/2} \times e^{-f/t } cm^{3} s^{-1}
    + Where t = T/1e4 K
      | a    |  0.1037 |
      | b    | -0.2657 |
      | c    |  0.2045 |
      | d    | -0.0029 |
      | f    |    3.03 |
      | Tmin |    3500 |
      | Y    |   0.002 |
    + So this gives negligibly small values and can be ignored
* TODO Combination with (Te, Ne) from He I lines
:LOGBOOK:
CLOCK: [2014-04-18 Fri 17:05]--[2014-04-18 Fri 17:24] =>  0:19
:END:
+ We find Ne, Te from the He lines
+ Data and calculations [[id:674FBA41-692F-4BB3-8A3B-14292CE4FE03][here in keck-revisited.org]]
+ From Porter et al. 2007 it looks like:
  + 5048/5876 is T_{e}-sensitive, almost insensitive to N_{e}
    + Ratio goes approx as T_{e}^{1/2} so it may be tricky since the ratio at 10^{4} K is 0.015
    + [ ] Lines are not in the same waveband for Manu
      + 5048 is in green
      + 5876 is in red
      + So need to do interpolation first
    + 5048 is not covered by the Adal spectra
  + 6678/5876 is N_{e}-sensitive, almost insensitive to T_{e}
    + But only 10% variation between 10^{3} and 10^{4} pcc so high-precision required
    + And also in same  waveband (red)
    + [2014-06-21 Sat] This seems to work for the Adal spectra
      + at least I get ratios that are well-correlated with the O II density ratios
      + but they need to be corrected for extinction
    + 
